// LAZARUS, WIN-10\XP                        *** JsonStringToDatasetUni.pas ***

// ****************************************************************************
// * TJsonBase:                      Преобразовать JSON-строку в набор данных *
// ****************************************************************************

//                                                   Автор:       Труфанов В.Е.
//                                                   Дата создания:  10.11.2017
// Copyright © 2017 tve                              Посл.изменение: 13.11.2017

unit JsonStringToDatasetUni;

interface

uses
  SysUtils,Classes,DB;

implementation

// ****************************************************************************
// *                 Преобразовать JSON-строку в набор данных                 *
// ****************************************************************************
function JsonStringToDataset(jStr:String): TDataSet;
begin
  Result:=NIL;
end;

end.

// ********************************************* JsonStringToDatasetUni.pas ***

